In [1]:
import pandas as pd
import numpy as np

In [4]:
s1 = pd.Series(np.arange(5), index=np.arange(5)[::-1], dtype="int64")
s1

4    0
3    1
2    2
1    3
0    4
dtype: int64

In [6]:
s1.isin((1,2,3))

4    False
3     True
2     True
1     True
0    False
dtype: bool

In [8]:
s1[s1.isin((1,2,3))]

3    1
2    2
1    3
dtype: int64

In [11]:
s2 = pd.Series(np.arange(6), index=pd.MultiIndex.from_product([[0,1],["a","b","c"]]))
s2

0  a    0
   b    1
   c    2
1  a    3
   b    4
   c    5
dtype: int32

In [14]:
s2.iloc[s2.index.isin([(1,"a"),(0,"b")])]

0  b    1
1  a    3
dtype: int32

In [15]:
dates = pd.date_range("20190316", periods=8)
data1 = pd.DataFrame(np.random.randn(8,4), columns=["A","B","C","D"],index = dates)
data1

                   A         B         C         D
2019-03-16 -1.292000 -0.415042  0.044515  2.166876
2019-03-17 -1.076142  1.144248 -0.078094  0.061988
2019-03-18  0.491867  1.147928  0.853318  0.963650
2019-03-19  0.934548 -2.318644 -0.130132  0.993343
2019-03-20  0.372129 -0.638395 -0.257079  1.173283
2019-03-21  0.332639 -0.563432  0.176842  0.461269
2019-03-22 -1.581508  0.946195 -1.921952 -1.311958
2019-03-23  0.361989 -2.098973  0.777381 -0.355089

In [16]:
data1.where(data1 < 0)

                   A         B         C         D
2019-03-16 -1.292000 -0.415042       NaN       NaN
2019-03-17 -1.076142       NaN -0.078094       NaN
2019-03-18       NaN       NaN       NaN       NaN
2019-03-19       NaN -2.318644 -0.130132       NaN
2019-03-20       NaN -0.638395 -0.257079       NaN
2019-03-21       NaN -0.563432       NaN       NaN
2019-03-22 -1.581508       NaN -1.921952 -1.311958
2019-03-23       NaN -2.098973       NaN -0.355089

In [17]:
data2 = pd.DataFrame(np.random.randn(10,3), columns=list("abc"))
data2

          a         b         c
0 -1.288935  1.046010 -0.058462
1 -1.678902  1.297004 -0.292318
2 -2.003254  0.253806 -0.277046
3 -0.217494  0.658618  1.403104
4  0.773925  0.060845 -0.905827
5  0.791119 -0.646606  0.499760
6 -1.704981  1.178474 -0.636633
7 -0.013507  0.394862  0.352256
8 -0.135965  1.413495 -0.483925
9  2.210292 -1.033501  0.213118

In [18]:
data2.query("(a<b)")

          a         b         c
0 -1.288935  1.046010 -0.058462
1 -1.678902  1.297004 -0.292318
2 -2.003254  0.253806 -0.277046
3 -0.217494  0.658618  1.403104
6 -1.704981  1.178474 -0.636633
7 -0.013507  0.394862  0.352256
8 -0.135965  1.413495 -0.483925

In [19]:
data2.query("(b<c) & (a>c)")

          a         b         c
5  0.791119 -0.646606  0.499760
9  2.210292 -1.033501  0.213118